<a href="https://colab.research.google.com/github/BenjaminDKLuong/Time_series_notes/blob/master/test1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np

In [2]:
for i in range(7,12):
  print(i)

7
8
9
10
11

In [0]:
df = pd.DataFrame({'num_legs': [2, 4, 8, 0],
                    'num_wings': [2, 0, 0, 0],
                    'num_specimen_seen': [10, 2, 1, 8]}
                   )

In [7]:
df

   num_legs  num_wings  num_specimen_seen
0         2          2                 10
1         4          0                  2
2         8          0                  1
3         0          0                  8

In [8]:
df.loc[0:2]

   num_legs  num_wings  num_specimen_seen
0         2          2                 10
1         4          0                  2
2         8          0                  1